current/app/controllers/candies_controller.rb

  def index
    @candies = Candy.all
---
SELECT `candies`.* FROM `candies`

  def create
    @candy = Candy.new(candy_params)

    respond_to do |format|
      if @candy.save
---
INSERT INTO `candies` (`title`, `image_file_name`, `image_content_type`, `image_file_size`, `image_updated_at`, `manufacturer`, `created_at`, `updated_at`) VALUES ('TitleCandy1', 'cvet-ovechki.jpg', 'image/jpeg', 33774, '2016-09-27 22:21:09.494490', 'ManufacturerCandy1', '2016-09-27 22:21:09.800980', '2016-09-27 22:21:09.800980')

    def set_candy
      @candy = Candy.find(params[:id])
---
SELECT  `candies`.* FROM `candies` WHERE `candies`.`id` = 2 LIMIT 1