current/app/controllers/home_controller.rb

SELECT `products`.* FROM `products` WHERE `products`.`types` = 'titul1'
---
  def index
    @products = Product.where(types: 't')

SELECT `products`.* FROM `products` WHERE `products`.`types` = 'r'
---
  def roshen
    @products = Product.where(types: 'r')

SELECT `products`.* FROM `products` WHERE `products`.`types` = 'c'
---
  def classic
    @products = Product.where(types: 'c')

SELECT `packings`.* FROM `packings`
---
  def np
    @products = Packing.all

SELECT `products`.* FROM `products` WHERE `products`.`types` = 'Подарки Престиж'
---
  def prestig
    @products = Product.where(types: 'p')

SELECT `products`.* FROM `products` WHERE `products`.`types` = 'Подарки VIP'
---
  def vip
    @products = Product.where(types: 'v')

SELECT `products`.* FROM `products` WHERE `products`.`types` IN ('v', 'p', 'r', 'c')
---
  def all
    @products = Product.where(types: ['v','p','r','c'])