current/app/controllers/packings_controller.rb

SELECT `packings`.* FROM `packings`
---
  def index
    @packings = Packing.all

INSERT INTO `packings` (`image_file_name`, `image_content_type`, `image_file_size`, `image_updated_at`, `title`, `description`, `price`, `created_at`, `updated_at`) VALUES ('cirk.jpg', 'image/jpeg', 36621, '2016-09-27 22:22:00.343037', 'TitlePacking1', 'TitleDescription1', 222, '2016-09-27 22:22:00.774386', '2016-09-27 22:22:00.774386')
---
  def create
    @packing = Packing.new(packing_params)

    respond_to do |format|
      if @packing.save

UPDATE `packings` SET `description` = 'DescriptionPacking2 DescriptionPacking2 DescriptionPacking2DescriptionPacking2DescriptionPacking2DescriptionPacking2DescriptionPacking2DescriptionPacking2DescriptionPacking2DescriptionPacking2', `updated_at` = '2016-09-26 14:04:38.378631' WHERE `packings`.`id` = 2
---
  def update
    respond_to do |format|
      if @packing.update(packing_params)

DELETE FROM `packings` WHERE `packings`.`id` = 1
---
  def destroy
    @packing.destroy

SELECT  `packings`.* FROM `packings` WHERE `packings`.`id` = 2 LIMIT 1
---
    def set_packing
      @packing = Packing.find(params[:id])