current/app/controllers/products_controller.rb

  def index
    @products = Product.all.sort_by {|x| [x.types] }
---
SELECT `products`.* FROM `products`

  def new
    @product = Product.new
    @packings = Packing.all
    @candies = Candy.all
---
SELECT `packings`.* FROM `packings`
SELECT `candies`.* FROM `candies`

  def edit
    @packings = Packing.all
    @candies = Candy.all
---
SELECT `packings`.* FROM `packings`
SELECT `candies`.* FROM `candies`

  def create
    @product = Product.new(product_params)
    # binding.pry

    respond_to do |format|
      if @product.save

        product_id = @product.id
        candy_ids = params['check_box'].keys
        counts = params['count']

        candy_ids.each do |candy_id|
          @product.candies << Candy.find(candy_id)
          count = counts[candy_id]
          CandiesProduct.where(product_id:@product.id, candy_id: candy_id).first.update_attributes(count:count)
---
INSERT INTO `products` (`title`, `description`, `price`, `image_file_name`, `image_content_type`, `image_file_size`, `image_updated_at`, `types`, `created_at`, `updated_at`) VALUES ('TitleProduct1', 'DescriptionProduct1', 123, 'Detsky-prazdnik.jpg', 'image/jpeg', 34442, '2016-09-27 22:20:21.587159', 'c', '2016-09-27 22:20:22.635610', '2016-09-27 22:20:22.635610')
SELECT  `candies`.* FROM `candies` WHERE `candies`.`id` = 1 LIMIT 1
SELECT  `candies_products`.* FROM `candies_products` WHERE `candies_products`.`product_id` = 16 AND `candies_products`.`candy_id` = 1  ORDER BY `candies_products`.`id` ASC LIMIT 1
UPDATE `candies_products` SET `count` = NULL WHERE `candies_products`.`id` = 8

  def update
    respond_to do |format|
      if @product.update(product_params)
---
UPDATE `products` SET `description` = 'DescriptionProduct1 DescriptionProduct1 DescriptionProduct1 DescriptionProduct1 DescriptionProduct1 DescriptionProduct1 DescriptionProduct1 DescriptionProduct1 DescriptionProduct1 DescriptionProduct1 DescriptionProduct1 DescriptionProduct1 DescriptionProduct1 DescriptionProduct1DescriptionProduct1DescriptionProduct1 DescriptionProduct1  v vDescriptionProduct1 DescriptionProduct1 DescriptionProduct1 DescriptionProduct1 DescriptionProduct1 DescriptionProduct1 DescriptionProduct1 DescriptionProduct1 DescriptionProduct1 DescriptionProduct1 DescriptionProduct1 DescriptionProduct1 v', `updated_at` = '2016-09-26 14:55:21.061183' WHERE `products`.`id` = 7